{
    "developer": {
        "name":"Miguel Ángel Mireles Vázquez",
        "career":"B. Sc. in Computer Science",
        "socialMedia":{
            "linkedIn":"https://www.linkedin.com/in/ines-alejandro-garcia-mosqueda-8128a8237/",
            "gitHub":"https://github.com/Ineso1",
            "instagram":"a",
            "discord":"https://discord.gg/xQJFp9MF",
            "faceboock":"a",
            "curriculum":"a"
        },
        "about":{
            "history":"I am Miguel Ángel Mireles Vázquez a dedicated and ambitious computer science student at the Universidad de Guanajuato with a passion for technology and its potential to make a positive impact on the world. With a strong foundation in programming and software development, I am well-equipped to tackle any challenge that comes my way. Whether it's developing new software solutions or troubleshooting complex systems, I am confident in my abilities to deliver high-quality results. I am also highly motivated and eager to learn, always seeking out new opportunities to expand my knowledge and skills. Whether it's through coursework, internships, or personal projects, I am committed to staying at the forefront of the rapidly-evolving field of computer science. With my knowledge and experience, I am poised to make a meaningful contribution to the world of technology and help shape the future.",
            "statistics":[
                {
                "title": "Development",
                "porcent":80    
                },
                {
                "title":"UI/UX design",
                "porcent":50
                },
                {
                "title":"SoftSkills",
                "porcent":60
                }
            ]
        }
    },
    "resume":{
        "education":[
            {
                "id": 1,
                "icon": "icon-graduation",
                "year": "2021 - 2025",
                "title": "B. Sc. in Computer Science",
                "institution": "Universidad de Guanajuato",
                "desc": "GPA: 95.1/100"
            },
            {
                "id": 2,
                "icon": "icon-graduation",
                "year": "2018 - 2021",
                "title": "Mechatronics Technician",
                "institution": "High School ENMS Salamanca",
                "desc": "GPA: 99.3/100"
            }
        ],
        "experience":[
            {
                "icon": "icon-graduation",
                "year": "December 2022 - Present",
                "title": "Exploratory Data Analysis Course",
                "institution": "Platzi",
                "desc": "Online course"
            },
            {
                "icon": "icon-graduation",
                "year": "August 2022",
                "title": "Mathematics Course for Data Science",
                "institution": "Platzi",
                "desc": "Online course"
            },
            {
                "icon": "icon-graduation",
                "year": "June 2022",
                "title": "ECMAScript 6+ Certification",
                "institution": "Platzi",
                "desc": "Online course"
            },
            {
                "icon": "icon-graduation",
                "year": "March 2022 - May 2022",
                "title": "React Advanced Course",
                "institution": "Platzi",
                "desc": "Online course"
            },
            {
                "icon": "icon-graduation",
                "year": "January 2022 - March 2022",
                "title": "JavaScript Professional Course",
                "institution": "Platzi",
                "desc": "Online course"
            },
            {
                "icon": "icon-graduation",
                "year": "December 2021",
                "title": "Terminal and Command line Course",
                "institution": "Platzi",
                "desc": "Online course"
            },
            {
                "icon": "icon-graduation",
                "year": "November 2021",
                "title": "Profesional Git and GitHub Course", 
                "institution": "Platzi",
                "desc": "Online course"
            }
        ]

    },
    "portfolio":[
        {
            "priority":1,
            "name": "ISS tracker and collision avoidance web app",
            "about": "Global Nominee of Nasa Space App Challenge 2022.\nThe ISS tracker and collision avoidance web app by Dagon, is an open-source web app, where the user can know the actual location of the International Space Station, check for real coalitions alerts with space trash and space debris, satellites and space bodies detected and located with the Satellite.js library, in a 3D space, which simulates the world, its atmosphere, the International Space Station and the illumination of the sun, all this at real time with real data.\nOur proposal includes development of the ISS tracking and mapping in a 3D space, as well as a collision prediction estimate. Our tracking system was developed as a web application written in JavaScript with Node and React and Three.js. We implemented a rendered for Three.js called React-three-fiber which allows us to load 3D models of the ISS itself, the nearby satellites, and all the space trash data into a space.\nThe application relies on the TLE data provided from Celestrak (considering NORAD and NASA's GOES data) and an API provided from Open Notify which provides us the ISS position in real time.",
            "date": "oct. 2022",
            "image": ["https://media.discordapp.net/attachments/716441619661979678/1067735855000719420/DALLE_2023-01-25_03.21.03_-_iss_tracker_vaporwave.png?width=663&height=663"],
            "technologies": ["HTML","CSS","JavaScript","React","Three.js", "Satellite.js", "Node.js"],
            "GitHub":"https://github.com/MAMV3x3/space-apps-challenge-2022"
        },
        {
            "priority":1,
            "name": "Fruit classifier with artificial vision",
            "about": "Low-cost industrial fruit classifier is an affordable solution for fruit processing facilities looking to improve their sorting and grading process. By utilizing cutting-edge artificial vision technology, the machine is able to accurately identify and distinguish between different types and sizes of fruits, as well as detect any imperfections or defects. This ensures that only the highest quality fruits are packaged and sent to market. The machine is designed for easy operation and maintenance, ensuring minimal downtime. Additionally, it is made of low-cost materials and manufactured with cost-effective methods making it very accessible. It's a great option for small and medium-size fruit processing operations looking to improve efficiency and quality control. Not only improves the sorting and grading process but also includes a dynamic website for productivity analysis. The website allows users to access real-time data on the machine's performance, including sorting speed, accuracy and efficiency. This allows managers and operators to monitor the machine's productivity and identify areas for improvement. Additionally, it offers detailed reports, charts and graphs for easy data interpretation, making it easy to see the performance of the classifier over time.",
            "date": "oct. 2022 - present",
            "image": ["https://media.discordapp.net/attachments/716441619661979678/1067740252606836776/DALLE_2023-01-25_03.38.36_-_Low-cost_industrial_Fruit_classifier_with_artificial_vision.png?width=663&height=663"],
            "technologies": ["Python","JavaScript","SQL","Node.js","React","Express","OpenCv","Eagle","Arduino"],
            "GitHub":"https://github.com/MAMV3x3/FruitClasify_product"
        },
        {
            "priority":2,
            "name": "Pits Telemetry Interface",
            "about": "Our team has developed a cutting-edge solution to address one of the most pressing environmental issues of our time - improper waste sorting. The project was developed for the HackMTY 2022 Hackathon, with the goal of creating a better resource management.\nThis project aims to use artificial vision to detect and sort garbage. The project is divided into two main parts:\nPython files with trained artificial intelligence: These files contain the deep learning model that has been trained to recognize and classify different types of garbage.\nServer to interpret in React: This server is used to interpret and process the data collected by the AI model. It is likely that it will be used to control the sorting and disposal of the garbage.\nMatlab scripts are used to analyze the training data and evaluate the performance of the model.\nThe system is described as using artificial vision to detect the garbage and then using the trained AI model to classify and sort it. The results are then interpreted and processed by the server and possibly used to control the disposal of the garbage.\nThis project involves training a deep learning model for image recognition, specifically using the GoogleNet architecture, to classify different types of garbage (such as organic, plastics, paper, and others). The trained model is then integrated into a prototype system for automated control, which is designed to function as an 'intelligent' garbage bin. The system is able to use the image recognition model to distinguish between different types of garbage and sort them into the appropriate bin. The goal of this project is to improve the efficiency of waste sorting in households and communities.",
            "date": "Aug 2022",
            "image": ["https://media.discordapp.net/attachments/716441619661979678/1067740897162301481/DALLE_2023-01-25_03.41.09_-_Pits_Telemetry_Interface.png?width=663&height=663"],
            "technologies": ["Matlab","Python","Flak","React","GoogleCloud"],
            "GitHub":"https://github.com/MAMV3x3/Interfaz-telemetria-Thunder-Rams-Pits"
        },
        {
            "priority":2,
            "name": "E-commerce and brand concept for a clothing brand",
            "about": "Our e-commerce website, built with React, will showcase our collection of clothing and allow customers to easily browse and purchase items. The website will have a clean and minimalistic design, with a focus on showcasing the clothing and making it easy for customers to find what they're looking for. The website will also have features such as a shopping cart, and the ability to save items to a wishlist. The brand concept for our urban clothing brand is 'Wilted.', We aim to provide clothing that reflects the latest street fashion trends while still being practical and comfortable for everyday wear. Our clothing is designed for the urban dweller who wants to make a statement with their style. We believe that fashion is a form of self-expression, and our clothing allows our customers to express themselves in a unique and bold way. Our e-commerce website will reflect our brand's urban aesthetic, with a clean and modern design. The website will be easy to navigate, with clear categories and filters to help customers find the perfect street-savvy look. Customers will be able to purchase clothing items, accessories, and exclusive limited-edition drops.",
            "date": "May 2022",
            "image": ["https://media.discordapp.net/attachments/716441619661979678/1067746997664239616/189520518-3fb2683a-26ec-4dad-aafd-970b1fe0078a.png?width=651&height=662"],
            "technologies": ["HTML","CSS","JavaScript","React","Node.js"],
            "GitHub":"https://github.com/MAMV3x3/MLH_GHW_wiltedProject"
        },
        {
            "priority":1,
            "name": "Portfolio website template",
            "about": "This project is a web portfolio template created using React.js. It includes a responsive design and user-friendly interface for showcasing personal projects, skills, and experiences. The template features a clean and modern layout, with sections for an about me, portfolio, and contact information. The template also includes a functional contact form and an option to display social media links. The project is fully customizable and can be easily adapted to fit the needs of any individual or business. The project is open source and available on GitHub for anyone to use and contribute to. It is built with React, HTML, CSS, and JavaScript. This template is perfect for developers, designers, and professionals looking to create a polished and professional web portfolio.",
            "date": "Jan 2023 - Present",
            "image": ["https://media.discordapp.net/attachments/716441619661979678/1067742487143251968/Captura_de_pantalla_2023-01-25_034642.png?width=1248&height=663"],
            "technologies": ["HTML", "CSS", "React", "Three.js", "JavaScript"],
            "GitHub":"https://github.com/MAMV3x3/portfolio-template"
        },
        {
            "priority":2,
            "name": "Test lap performance telemetry interface",
            "about": "This project is a telemetry system designed to monitor a prototype electric car in real-time. The system was developed to analyze and monitor the performance of the prototype vehicle during testing and development. It makes use of data received from the car's onboard computer via a serial port, which is then parsed and visualized in an intuitive and user-friendly manner. The system was first developed in electron, which allows the creation of animations of the car and real-time tracking of its position on a map. The second version of the system was built using C# and .NET, where the team can view more detailed information about the car on a dashboard. The system allows the team to view important data such as speed, angles of inclination, temperature, and geographic coordinates in real-time. This information can be used to analyze the car's performance, monitor the car status, and make adjustments to optimize the car's performance during the prototype phase. The system can be integrated into the car's onboard computer or connected to a separate monitoring device, making it a valuable tool for any team developing a prototype electric car.",
            "date": "May 2022",
            "image": ["https://media.discordapp.net/attachments/716441619661979678/1067739350093266974/214516602-d6e7a621-120f-4c1e-addc-a1252cc7b9ae.jpg?width=1231&height=663"],
            "technologies": ["C#","JavaScript","Electron",".NET","GoogleCloud", "Arduino"],
            "GitHub":"https://github.com/MAMV3x3/Interfaz-Telemetria-Thunder-Rams"
        },
        {
            "priority":3,
            "name": "Chat app",
            "about": "This project is a real-time chat application built using React and Firebase. It allows users to create a chat room and invite others to join. The chat room is updated in real-time as messages are sent and received. This project is perfect for small groups or teams that need a quick and easy way to communicate. The application is user-friendly and intuitive, making it easy for anyone to use. Users can create a chat room by providing their username. They can then invite others to join by sharing the room name and password. The chat room is updated in real-time, so users can see new messages as they are sent. The application also includes a feature that displays the active users in the chat room. This is useful for keeping track of who is currently online and available to chat. Users also have the option to leave or delete a chat room if they no longer wish to participate. The project uses React as its main framework, which allows for easy and efficient development. Firebase is used for user authentication and real-time messaging.",
            "date": "Oct 2022 - Present",
            "image": ["https://media.discordapp.net/attachments/716441619661979678/1067745597106421870/DALLE_2023-01-25_03.59.50_-_web_chat_app_modern.png?width=663&height=663"],
            "technologies": ["HTML","CSS","JavaScript","React","Node.js", "Firebase"],
            "GitHub":"https://github.com/MAMV3x3/chat-app"
        },
        {
            "priority":4,
            "name": "Candy vending machine",
            "about": "This project is a candy vending machine in VHDL, a digital system that can be modeled and implemented using the VHDL hardware description language. The VHDL code can be used to create a simulation of the vending machine, as well as to program a digital device such as a field-programmable gate array (FPGA) or an application-specific integrated circuit (ASIC) to control the physical vending machine. The VHDL code for the candy vending machine would likely include a state machine to keep track of the current state of the vending machine, such as whether it is idle, dispensing candy, or out of candy. The code would also include logic to handle input from the user, such as button presses to select a candy and insert money, as well as logic to control the dispensing mechanism and handle output, such as displaying the amount of money inserted and the available candy options. The VHDL project was tested with the simulation process in 'ModelSim', so now is ready to be implemented on FPGA or ASIC to operate on real vending machine.",
            "date": "Aug 2022",
            "image": ["https://media.discordapp.net/attachments/716441619661979678/1067749375289327676/DALLE_2023-01-25_04.14.49_-_candy_vending_machine_vaporwave.png?width=663&height=663"],
            "technologies": ["VHDL", "ModelSim", "FPGA"],
            "GitHub":"https://github.com/MAMV3x3/State-machine-for-candy-vending-machine-in-VHDL"
        },
        {
            "priority":3,
            "name": "Web Multiplayer game",
            "about": "A web multiplayer game using Node.js and React utilizing the power of Node.js as the server-side technology to handle game logic and real-time communication between players, and React as the front-end library for building the user interface. The game uses WebSocket to enable real-time communication between players and the server. This would allow for fast and responsive gameplay, allowing players to interact with each other in real-time. On the server-side, Node.js is used to handle game logic such as player movement, collision detection, and scoring. It would also be responsible for managing the real-time communication between players, ensuring that all players are in sync with each other. On the client-side, React is used to build the user interface, which would include the game board, player avatars, and various buttons and controls. React's component-based architecture would make it easy to build a modular and reusable user interface, which would help to keep the codebase maintainable.",
            "date": "Sep 2022 - Present",
            "image": ["https://media.discordapp.net/attachments/716441619661979678/1067756969517142076/DALLE_2023-01-25_04.45.01_-_pokemon_style_game_multiplayer_2d_combat.png?width=663&height=663"],
            "technologies": ["Node.js","React","WebSocket","JavaScript","HTML","CSS"],
            "GitHub":"https://github.com/MAMV3x3/mokepon"
        },
        {
            "priority":4,
            "name": "BeeTutor",
            "about": "This web application is designed to connect students with other students who can offer mentorship and guidance in their respective fields of study. The app will allow students to create profiles, search for mentors based on specific criteria, and connect with mentors through messaging and video conferencing. The app have several key features, including: Profile creation: Students can create profiles that include information about their field of study, experience, and areas of expertise. Mentor search: Students can search for mentors based on criteria such as field of study, experience, and location. Messaging and video conferencing: Once a mentor and mentee have connected, they can communicate through the app's messaging feature and schedule video conferences to discuss their mentoring relationship. Mentor ratings and feedback: Mentees will be able to rate their mentors and provide feedback on their experience (work in progress). This project is open-source and welcomes contributions from developers, designers, and anyone interested in helping improve the app.",
            "date": "May 2021 - Present",
            "image": ["https://media.discordapp.net/attachments/716441619661979678/1067751482415394826/image.png?width=1258&height=663"],
            "technologies": ["HTML", "CSS", "JavaScript"],
            "GitHub":"https://github.com/MAMV3x3/beehack2021"
        }
    ]
  }